---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCImportOptions
source: html/f98f40e2-dbab-4b4c-7fcb-36df9b35cad5.htm
---
# Autodesk.Revit.DB.IFC.IFCImportOptions

IFC Import options.

## Syntax (C#)
```csharp
public class IFCImportOptions : IDisposable
```